n, k = map(int, input().split())
arr = list(range(1, n + 1))
ans = []

i = 0
while arr:
    i = (i + k - 1) % len(arr)  # 2, 4, 6
    ans.append(str(arr.pop(i)))

# list로 하면 <12, 4, 17>로 나올것이 스트링으로 하면 <1, 2, 4, 1, 7>로 나온다.
# 조심하자!!!
ans = ', '.join(ans)
print(f'<{ans}>')

# 2 4 1(6 % 5)

# 1 2 4 5 7
# 3
# ------------

# 1 2 4 5 7
# 3 6
# ------------

# 1 4 5 7
# 3 6 2
# ------------

# 1 4 5
# 3 6 2 7
# ------------

# 1 4
# 3 6 2 7 5
# ------------

# 4
# 3 6 2 7 5 1
# ------------

# 3 6 2 7 5 1 4
